Repository: alidzapp/youtube_dlhelper
Catalog: doc/*/Config.po
Languages: de_de

source: The config file
de_de: Das Konfigurationsfile

source: <primary>The config file</primary>
de_de: <primary>Das Konfigurationsfile</primary>

source: The config file gives you options to customize it to your needs.
de_de: Das Konfigurationsfile gibt Ihnen Möglichkeiten zur Anpassung.

source: Global settings
de_de: Globale Einstellung

source: <primary>The config file</primary> <secondary>Global settings</secondary>
de_de: <primary>Das Konfigurationsfile</primary> <secondary>Globale Einstellungen</secondary>

source: Global variables
de_de: Globale Variablen

source: Variable name
de_de: Variablenname

source: Default value
de_de: Vorgabe

source: Explaining
de_de: Erklärung

source: Accept MP3 instead of OGG?
de_de: OGG statt MP3 akzeptieren?
