Repository: alidzapp/youtube_dlhelper
Catalog: doc/*/Introduction.po
Languages: de_de

source: Introduction
de_de: Einführung

source: <primary>Introduction</primary>
de_de: <primary>Einführung</primary>

source: Before you can start you must check if you have installed Ruby. To do this you can type in a console: <command>ruby --version</command>. The output can be similar to that one:
de_de: Bevor Sie starten können, müssen Sie herausfinden, ob bereits Ruby installiert ist. Dazu geben Sie in der Konsole folgendes ein: <command>ruby --version</command>. Der Output sollte ähnlich wie dieser:

source: If there are no ruby inside the output you have to go to <xref linkend="install-ruby" />. Otherwise you can skip that step and go to <xref linkend="install-ytdl" />.
de_de: Wenn Ruby nicht installiert ist, springen Sie zum Abschnitt <xref linkend="install-ruby" />. Andernfalls springen Sie zu <xref linkend="install-pubcre" />.

source: Installing Ruby
de_de: Ruby installieren

source: One of the easiest way to install ruby is by using RVM. So follow the next steps:
de_de: Einer der einfachsten Wege Ruby zu installieren läuft über RVM. Dazu gehen Sie folgendermaßen vor:

source: Type in your console: <command>gpg --keyserver hkp://keys.gnupg.net --recv-keys 409B6B1796C275462A1703113804BB82D39DC0E3</command>
de_de: Geben Sie in der Konsole folgendes ein: <command>gpg --keyserver hkp://keys.gnupg.net --recv-keys 409B6B1796C275462A1703113804BB82D39DC0E3</command>

source: Type now: <command>curl -sSL https://get.rvm.io | bash -s stable</command>
de_de: Geben Sie jetzt ein: <command>curl -sSL https://get.rvm.io | bash -s stable</command>

source: The output should like similar to that one:
de_de: Der Output sollte ähnlich diesem aussehen:

source: If this command fails, you have to install the <package>curl</package> package. Use your package manager to do this.
de_de: Wenn dieses Kommando fehlschlägt, installieren SIe das Paket <package>curl</package>. Nutzen Sie dazu Ihren Paketmanager.

source: To use RVM you have two options. First you can logout yourself and login again. The other option is just to type: <command>source /home/<replaceable>sascha</replaceable>/.rvm/scripts/rvm</command>. Instead of <quote>sascha</quote> you have to place your username.
de_de: Um RVM zu nutzen, haben Sie zwei Möglichkeiten. Entweder loggen Sie sich aus, und wieder ein, oder geben Sie folgendes in der Konsole ein: <command>source /home/<replaceable>sascha</replaceable>/.rvm/scripts/rvm</command>. Statt <quote>sascha</quote> geben Sie Ihren Usernamen ein.

source: Now type: <command>rvm install <replaceable>2.2.1</replaceable></command>. If any later ruby than you can replace the 2.2.1 with the newer version.
de_de: Geben Sie jetzt ein: <command>rvm install <replaceable>2.2.1</replaceable></command>. Falls eine neuere Rubyversion verfügbar ist, können sie die 2.2.1 mit dieser Versionsnummer austauschen.

source: The output shows similar that:
de_de: Der Output sollte ähnlich diesem aussehen:

source: A <command>ruby --version</command> should output your version:
de_de: Ein <command>ruby --version</command> sollte jetzt die Rubyversion ausgeben.

source: You installed now Ruby (hopefully) without troubles. For further information about RVM you can visit this <link xlink:href="https://rvm.io/">link</link>.
de_de: Nun haben Sie Ruby (hoffentlich) ohne Probleme installiert. Weiterführende Informationen zu RVM gibt es hier: <link xlink:href="https://rvm.io/">link</link>.

source: For installing &BOOKID; you now have to type in the console: <command>gem install &BOOKID;</command>. This command solves the soft-dependencies of the program. The output looks similar that one:
de_de: Um &BOOKID; zu installieren, geben Sie in der Konsole folgendes ein: <command>gem install &BOOKID;</command>. Dieser Befehl installiert automatisch alle Abhängigkeiten. Der Output sollte ähnlich diesem aussehen:

source: The installation can takes some time, because some of the dependencies must compiled natively on your computer.
de_de: Die Installation könnte etwas dauern, da möglicherweise Abhängigkeiten kompiliert werden.

source: Running the setup
de_de: Das Setup starten

source: <primary>Introduction</primary> <secondary>Running the setup</secondary>
de_de: <primary>Einführung</primary> <secondary>Das Setup ausführen</secondary>

source: For running the setup go to the gem's directory with <command>.rvm/gems/ruby-<replaceable>2.2.1</replaceable>/gems/&BOOKID;-<replaceable>&pcver;</replaceable></command>. Then just type <command>rake setup_start</command>.
de_de: Um das Setup zu starten, gehen Sie in das Verzeichnis des Gems: <command>.rvm/gems/ruby-<replaceable>2.2.1</replaceable>/gems/&BOOKID;-<replaceable>&pcver;</replaceable></command>. Geben Sie dort ein: <command>rake setup_start</command>.

source: Keep in mind, that the <quote>2.2.1</quote> from <quote>ruby-2.2.1</quote> must match your chosen version. Also you have to replace <replaceable>&pcver;</replaceable> with the installed version of &BOOKID;.
de_de: Behalten Sie im Hinterkopf, das die 2.2.1 aus ruby-2.2.1 die installierte Rubyversion repräsentiert. Somit sollte <replaceable>&pcver;</replaceable> auch die installierte &BOOKID; Version repräsentieren.

source: The setup script does the following:
de_de: Das Setupscript macht folgendes:

source: If you have already a <filename>.youtube_dlhelper.conf</filename> in your Homedirectory it will add the actual shipped <filename>.youtube_dlhelper.conf</filename> as <filename>.youtube_dlhelper.cfg.new</filename> in your home directory. You have to check, if new parameters are added or depreached one are there. So modify your old <filename>.youtube_dlhelper.conf</filename> to match the new one.
de_de: Wenn Sie bereits eine <filename>.youtube_dlhelper.conf</filename> in Ihrem Homedirectory plaziert haben, wird die aktuell ausgelieferte als <filename>.youtube_dlhelper.cfg.new</filename> installiert. Sie sollten prüfen, ob Änderungen zu Ihrer alten Version vorgenommen wurden, und Ihre alte dementsprechend anpassen.

source: If you aren't have a old <filename>.youtube_dlhelper.conf</filename> the setup copies a actual version in your home directory and will launch a texteditor with the config loaded. So you can modify it to your needs. The config file will be explained in the next chapter.
de_de: Falls Sie nicht über eine alte <filename>.youtube_dlhelper.conf</filename> verfügen, wird die aktuelle installiert, und in einem grafischen Texteditor geöffnet.

source: The last thing in the setup is to install a starter-binary in <filename>/usr/bin</filename>.
de_de: Als letzter Punkt installiert das Setup ein Starter-Binary in <filename>/usr/bin</filename>.

source: The whole setup process looks like that output:
de_de: Der Setup-Prozess sieht ähnlich diesen aus:

source: Update from a older version
de_de: Aktualisieren einer älteren Version

source: If you have an older version of &BOOKID;, you can run <command>rake setup</command>.
de_de: Falls Sie eine ältere Version installiert haben, geben Sie im neuen Gemverzeichnis ein: <command>rake setup</command>.
